stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
/**
  ******************************************************************************
  * @file    sid_pal_ble_adapter_stm32wba_utils.c
  * @brief   Private utility functions and helpers of the Sidewalk BLE driver
  * 
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stdio.h>

#include "sid_pal_ble_adapter_stm32wba_utils.h"
#include "bluetooth_hci_defs.h"

/* Sidewalk interfaces */
#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_crypto_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_storage_kv_ifc.h>

/* Platform-specific headers */
#include <hw.h>
#include <hw_if.h>
#include <otp.h>
#include <stm32wbaxx_hal.h>

/* Utilities and helpers */
#include <sid_stm32_common_utils.h>

/* Private defines -----------------------------------------------------------*/

#define SID_BLE_ADAPTER_UTILS_PADDED_PRAND_LEN         (16u)

/* Private macro -------------------------------------------------------------*/

#ifndef SID_BLE_ADAPTER_UTILS_EXTRA_LOGGING
/* Set SID_BLE_ADAPTER_UTILS_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_BLE_ADAPTER_UTILS_EXTRA_LOGGING          (0)
#endif

#if SID_BLE_ADAPTER_UTILS_EXTRA_LOGGING
#  define SID_BLE_ADAPTER_UTILS_LOG_ERROR(...)         SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_BLE_ADAPTER_UTILS_LOG_WARNING(...)       SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_BLE_ADAPTER_UTILS_LOG_INFO(...)          SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_BLE_ADAPTER_UTILS_LOG_DEBUG(...)         SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_BLE_ADAPTER_UTILS_LOG_TRACE(...)         SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_BLE_ADAPTER_UTILS_LOG_ERROR(...)         ((void)0u)
#  define SID_BLE_ADAPTER_UTILS_LOG_WARNING(...)       ((void)0u)
#  define SID_BLE_ADAPTER_UTILS_LOG_INFO(...)          ((void)0u)
#  define SID_BLE_ADAPTER_UTILS_LOG_DEBUG(...)         ((void)0u)
#  define SID_BLE_ADAPTER_UTILS_LOG_TRACE(...)         ((void)0u)
#endif

/* External variables --------------------------------------------------------*/

extern sid_pal_ble_adapter_ctx_t sid_ble_drv_ctx;

/* Imported function prototypes ----------------------------------------------*/

extern void SMA_Generate_IRK(uint8_t irk[16]);

/* Private function prototypes -----------------------------------------------*/

static inline sid_error_t _verify_random_mac_address_random_part(sid_pal_ble_prv_bt_addr_buffer_t * const buffer);
static inline sid_error_t _generate_generic_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const buffer);
static inline sid_error_t _generate_random_key(uint32_t * const buffer, const uint32_t words_len);

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _verify_random_mac_address_random_part(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err;
    uint32_t    rnd_part;

    do
    {
        /* At least one bit in random part shall be zero */
        if ((buffer->words[0] ^ 0xFFFFu) == 0u)
        {
            rnd_part = buffer->words[1] | 0xC0FFu; /* Filter out two MSB as they do not belong to the random part of address and 16 LSB as they are not used */
            if ((rnd_part ^ 0xFFFFu) == 0u)
            {
                /* All random bits are 1, address is invalid */
                err = SID_ERROR_PARAM_OUT_OF_RANGE;
                break;
            }
        }

        /* At least one bit in random part shall be 1 */
        if ((buffer->words[0] ^ 0x0000u) == 0u)
        {
            rnd_part = buffer->words[1] & 0x4F00u; /* Filter out two MSB as they do not belong to the random part of address and 16 LSB as they are not used */
            if ((rnd_part ^ 0x0000u) == 0u)
            {
                /* All random bits are 0, address is invalid */
                err = SID_ERROR_PARAM_OUT_OF_RANGE;
                break;
            }
        }

        err = SID_ERROR_NONE;
    } while(0);

#if defined(CFG_STATIC_RANDOM_ADDRESS)
    /* Prevent infinite loop if invalid static address override is provided in configuration */
    if (err != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("CFG_STATIC_RANDOM_ADDRESS is invalid. Enforced static address does not comply with BLE specification section 1.3.2 and cannot be used");
        SID_PAL_ASSERT(0);
    }
#endif

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _generate_generic_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t status = SID_ERROR_GENERIC;

#ifdef CFG_STATIC_RANDOM_ADDRESS
    buffer->words[0] = CFG_STATIC_RANDOM_ADDRESS & 0xFFFFFFFFu;
    buffer->words[1] = (uint32_t)((uint64_t)CFG_STATIC_RANDOM_ADDRESS >> 32);
    status = SID_ERROR_NONE;
#else
    status = sid_pal_crypto_rand(buffer->bytes, sizeof(buffer));
#endif /* CFG_STATIC_RANDOM_ADDRESS */

    return status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _generate_random_key(uint32_t * const buffer, const uint32_t words_len)
{
    sid_error_t status = SID_ERROR_GENERIC;
    uint32_t zero_check;
    uint32_t one_check;

    do
    {
        if ((NULL == buffer) || (0u == words_len))
        {
            status = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Generate random data */
        status = sid_pal_crypto_rand((void *)buffer, words_len * sizeof(uint32_t));
        if (status != SID_ERROR_NONE)
        {
            SID_BLE_ADAPTER_UTILS_LOG_ERROR("  Fail   : Unable to generate random key data. sid_pal_crypto_rand failed, error: %d", (int32_t)status);
            break;
        }

        /* Check the generated random data is not all zeros or all ones */
        zero_check = 0u;
        one_check = 0u;
        for (uint32_t i = 0u; i < words_len; i++)
        {
            zero_check |= buffer[i];
            one_check |= (buffer[i] ^ UINT32_MAX);
        }

        status = SID_ERROR_NONE;
    } while ((0u == zero_check) || (0u == one_check));

