stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
    return status;
}

/* Global function definitions -----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_stm32wba_ble_adapter_util_sprintf_uuid(char * const buf, const sid_ble_cfg_uuid_info_t * const uuid)
{
    int32_t pos = 0;

    if (UUID_TYPE_16 == uuid->type)
    {
        pos = sprintf(buf, "%02x%02x", uuid->uu[0], uuid->uu[1]);
    }
    else if (UUID_TYPE_32 == uuid->type)
    {
        pos = sprintf(buf, "%02x%02x%02x%02x", uuid->uu[0], uuid->uu[1], uuid->uu[2], uuid->uu[3]);
    }
    else if (UUID_TYPE_128 == uuid->type)
    {
        pos = sprintf(buf, "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-%02x%02x%02x%02x%02x%02x",
                      uuid->uu[ 0], uuid->uu[ 1], uuid->uu[ 2], uuid->uu[ 3],
                      uuid->uu[ 4], uuid->uu[ 5], uuid->uu[ 6], uuid->uu[ 7],
                      uuid->uu[ 8], uuid->uu[ 9], uuid->uu[10], uuid->uu[11],
                      uuid->uu[12], uuid->uu[13], uuid->uu[14], uuid->uu[15]
        );
    }
    else
    {
        /* do nothing */
    }

    return pos;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid(uint8_t * const out_uuid_type, Service_UUID_t * const out_uuid, const sid_ble_cfg_uuid_info_t * const in_uuid)
{
    if ((NULL == out_uuid_type) || (NULL == out_uuid) || (NULL == in_uuid))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    switch (in_uuid->type)
    {
        case UUID_TYPE_16:
            {
                out_uuid->Service_UUID_16 = in_uuid->uu[1] | (in_uuid->uu[0] << 8);
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_16;
            }
            break;

        case UUID_TYPE_128:
            {
                const uint32_t uuid_len = sizeof(out_uuid->Service_UUID_128);
                for (uint32_t i = 0u; i < uuid_len; i++)
                {
                    out_uuid->Service_UUID_128[i] = in_uuid->uu[uuid_len - i - 1u];
                }
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_128;
            }
            break;

        default:
            return SID_ERROR_INVALID_ARGS;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid(uint8_t * const out_uuid_type, Char_UUID_t * const out_uuid, const sid_ble_cfg_uuid_info_t * const in_uuid)
{
    if ((NULL == out_uuid_type) || (NULL == out_uuid) || (NULL == in_uuid))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    switch (in_uuid->type)
    {
        case UUID_TYPE_16:
            {
                out_uuid->Char_UUID_16 = in_uuid->uu[1] | (in_uuid->uu[0] << 8);
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_16;
            }
            break;

        case UUID_TYPE_128:
            {
                const uint32_t uuid_len = sizeof(out_uuid->Char_UUID_128);
                for (uint32_t i = 0u; i < uuid_len; i++)
                {
                    out_uuid->Char_UUID_128[i] = in_uuid->uu[uuid_len - i - 1u];
                }
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_128;
            }
            break;

        default:
            return SID_ERROR_INVALID_ARGS;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_desc_uuid(uint8_t * const out_uuid_type, Char_Desc_Uuid_t * const out_uuid, const sid_ble_cfg_uuid_info_t * const in_uuid)
{
    if ((NULL == out_uuid_type) || (NULL == out_uuid) || (NULL == in_uuid))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    switch (in_uuid->type)
    {
        case UUID_TYPE_16:
            {
                out_uuid-> Char_UUID_16 = in_uuid->uu[1] | (in_uuid->uu[0] << 8);
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_16;
            }
            break;

        case UUID_TYPE_128:
            {
                const uint32_t uuid_len = sizeof(out_uuid->Char_UUID_128);
                for (uint32_t i = 0u; i < uuid_len; i++)
                {
                    out_uuid->Char_UUID_128[i] = in_uuid->uu[uuid_len - i - 1u];
                }
                *out_uuid_type = STM32_WPAN_BLE_UUID_TYPE_128;
            }
            break;

        default:
            return SID_ERROR_INVALID_ARGS;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint8_t sid_stm32wba_ble_adapter_util_convert_sid_ble_addr_type_to_stm32_ble_addr_type(const sid_ble_cfg_mac_address_type_t mac_addr_type)
{
    uint8_t hal_addr_type;

    switch (mac_addr_type)
    {
        case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
            hal_addr_type = GAP_NON_RESOLVABLE_PRIVATE_ADDR;
            break;

        case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_RESOLVABLE:
            hal_addr_type = GAP_RESOLVABLE_PRIVATE_ADDR;
            break;

        case SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM:
            hal_addr_type = GAP_STATIC_RANDOM_ADDR;

        case SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC:
        default:
            hal_addr_type = GAP_PUBLIC_ADDR;
            break;
    }

    return hal_addr_type;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint8_t sid_stm32wba_ble_adapter_util_convert_sid_ble_addr_type_to_hci_own_adv_addr_type(const sid_ble_cfg_mac_address_type_t mac_addr_type)
{
    uint8_t own_address_type;

    /* Set advertisement parameters */
    switch (mac_addr_type)
    {
        case SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC:
            own_address_type = SID_BLE_HCI_ADV_OWN_ADDR_TYPE_PUBLIC;
            break;

        case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
        case SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM:
            own_address_type = SID_BLE_HCI_ADV_OWN_ADDR_TYPE_RANDOM;
            break;

        case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_RESOLVABLE:
            own_address_type = SID_BLE_HCI_ADV_OWN_ADDR_TYPE_RESOLVABLE_OR_RANDOM;
            break;

        default:
            own_address_type = SID_BLE_HCI_ADV_OWN_ADDR_TYPE_RANDOM;
            break;
    }

    return own_address_type;
}

