stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_generate_private_nonresolvable_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        do
        {
            err = _generate_generic_random_mac_address(buffer);
        } while ((SID_ERROR_NONE == err)
              && (_verify_random_mac_address_random_part(buffer) != SID_ERROR_NONE)); /* Ensure random data complies with BLE spec */

        if (err != SID_ERROR_NONE)
        {
            break;
        }

        buffer->bytes[5] &= 0x3Fu; /* The two upper bits shall be set to 00b */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_generate_private_resolvable_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;

    do
    {
        sid_pal_ble_prv_irk_buffer_t irk;
        uint8_t padded_prand[SID_BLE_ADAPTER_UTILS_PADDED_PRAND_LEN];
        uint8_t aes_enc_data[SID_BLE_ADAPTER_UTILS_PADDED_PRAND_LEN];

        /* Generate random data */
        err = _generate_generic_random_mac_address(buffer);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* The two upper bits shall be set to 01b */
        buffer->bytes[5] &= 0x3Fu;
        buffer->bytes[5] |= 0x40u;

        /* Load local IRK */
        SMA_Generate_IRK(irk.bytes);

        /* Prepare padded prand data */
        SID_STM32_UTIL_fast_memset(padded_prand, 0u, sizeof(padded_prand));
        padded_prand[0] = buffer->bytes[3];
        padded_prand[1] = buffer->bytes[4];
        padded_prand[2] = buffer->bytes[5];

        /* Compute random address hash using ah security function */
        ble_status = hci_le_encrypt(irk.bytes, padded_prand, aes_enc_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            err = SID_ERROR_ENCRYPTION_FAIL;
            break;
        }

        /* Put computed hash into BLE address buffer */
        buffer->bytes[0] = aes_enc_data[0];
        buffer->bytes[1] = aes_enc_data[1];
        buffer->bytes[2] = aes_enc_data[2];

        err = SID_ERROR_NONE;
    } while ((SID_ERROR_NONE == err)
          && (_verify_random_mac_address_random_part(buffer) != SID_ERROR_NONE)); /* Ensure random data complies with BLE spec */

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_generate_static_random_mac_address(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        do
        {
            err = _generate_generic_random_mac_address(buffer);
        } while ((SID_ERROR_NONE == err)
              && (_verify_random_mac_address_random_part(buffer) != SID_ERROR_NONE)); /* Ensure random data complies with BLE spec */

        if (err != SID_ERROR_NONE)
        {
            break;
        }

        buffer->bytes[5] |= 0xC0u; /* The two upper bits shall be set to 11b */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_get_host_public_addr(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (NULL == buffer)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

#if (CFG_BD_ADDRESS != 0)
        #warning "DON'T USE HARD-CODED BLE ADDRESS IN PRODUCTION"
        SID_PAL_LOG_WARNING("USING HARD-CODED BLE ADDRESS");
        buffer->dwords[0] = (uint64_t)(CFG_ADV_BD_ADDRESS);
#else
        /* Load Device Unique Number (UDN) */
        const uint32_t  udn = LL_FLASH_GetUDN();

        /* Build public address based on UDN if possible */
        if (udn != 0xFFFFFFFFu)
        {
            const uint32_t company_id = LL_FLASH_GetSTCompanyID();
            const uint32_t device_id = LL_FLASH_GetDeviceID();

            /**
             * Public Address with the ST company ID
             * bit[47:24] : 24bits (OUI) equal to the company ID
             * bit[23:16] : Device ID.
             * bit[15:0] : The last 16bits from the UDN
             * Note: In order to use the Public Address in a final product, a dedicated
             * 24bits company ID (OUI) shall be bought.
             */
            buffer->bytes[0] = (uint8_t)( udn       & 0xFFu);
            buffer->bytes[1] = (uint8_t)((udn >> 8) & 0xFFu);
            buffer->bytes[2] = (uint8_t)( device_id & 0xFFu);
            buffer->bytes[3] = (uint8_t)( company_id        & 0xFFu);
            buffer->bytes[4] = (uint8_t)((company_id >>  8) & 0xFFu);
            buffer->bytes[5] = (uint8_t)((company_id >> 16) & 0xFFu);
        }
        else
        {
            /* Try to read public address from OTP */
            OTP_Data_s *      p_otp_addr = NULL;
            HAL_StatusTypeDef hal_ret;

            hal_ret = OTP_Read(0, &p_otp_addr);
            if ((HAL_OK == hal_ret) && (p_otp_addr != NULL))
            {
                SID_STM32_UTIL_fast_memcpy(buffer->bytes, p_otp_addr->bd_address, sizeof(buffer->bytes));
            }
            else
            {
                SID_PAL_LOG_ERROR("Failed to read BLE address from OTP");
                err = SID_ERROR_STORAGE_READ_FAIL;
                break;
            }
        }
#endif /* CFG_BD_ADDRESS */

        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_get_host_static_random_addr(sid_pal_ble_prv_bt_addr_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (NULL == buffer)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

