stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
        /* Get static random address if it has already been generated */
        err = sid_pal_storage_kv_record_get(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_STATIC_RANDOM_ADDRESS_KEY, &buffer->words[0], sizeof(buffer->words));
        if (SID_ERROR_NONE == err)
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Loaded BLE static random address from KV storage");
            break;
        }
        else if (SID_ERROR_NOT_FOUND == err)
        {
            /* Generate new static random address */
            err = sid_stm32wba_ble_adapter_util_generate_static_random_mac_address(buffer);
            if (err != SID_ERROR_NONE)
            {
                break;
            }

            err = sid_pal_storage_kv_record_set(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_STATIC_RANDOM_ADDRESS_KEY, &buffer->words[0], sizeof(buffer->words));
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_ADAPTER_UTILS_LOG_ERROR("  Fail   : Unable to store BLE static random address to KV storage, error code: %d", err);
                break;
            }
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Stored new BLE static random address");
        }
        else
        {
            /* Failed to read from KV storage */\
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_get_local_irk_seed(sid_pal_ble_prv_irk_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (NULL == buffer)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Get static random address if it has already been generated */
        err = sid_pal_storage_kv_record_get(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_LOCAL_IRK_SEED_KEY, &buffer->words[0], sizeof(buffer->words));
        if (SID_ERROR_NONE == err)
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Loaded local BLE IRK seed from KV storage");
            break;
        }
        else if (SID_ERROR_NOT_FOUND == err)
        {
            /* Generate new IRK seed */
#if SID_STM32_BLE_USE_HARDCODED_SECURITY_KEYS
            #warning "DON'T USE HARD-CODED IRK IN PRODUCTION"
            uint8_t tmp_irk[] = CFG_BLE_IRK;
            SID_STM32_UTIL_fast_memcpy(buffer->bytes, tmp_irk, sizeof(buffer));
#else
            err = _generate_random_key(buffer->words, SID_STM32_UTIL_ARRAY_SIZE(buffer->words));
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_ADAPTER_UTILS_LOG_ERROR("Failed to generate new BLE IRK seed. Error %d", (int32_t)err);
                break;
            }
#endif /* SID_STM32_BLE_USE_HARDCODED_SECURITY_KEYS */

            err = sid_pal_storage_kv_record_set(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_LOCAL_IRK_SEED_KEY, &buffer->words[0], sizeof(buffer->words));
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_ADAPTER_UTILS_LOG_ERROR("  Fail   : Unable to store local BLE IRK seed to KV storage, error code: %d", err);
                break;
            }
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Stored new local BLE IRK seed");
        }
        else
        {
            /* Failed to read from KV storage */
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_get_erk(sid_pal_ble_prv_erk_buffer_t * const buffer)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (NULL == buffer)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Get static random address if it has already been generated */
        err = sid_pal_storage_kv_record_get(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_ERK_KEY, &buffer->words[0], sizeof(buffer->words));
        if (SID_ERROR_NONE == err)
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Loaded BLE ERK from KV storage");
            break;
        }
        else if (SID_ERROR_NOT_FOUND == err)
        {
            /* Generate new ERK */
#if SID_STM32_BLE_USE_HARDCODED_SECURITY_KEYS
            #warning "DON'T USE HARD-CODED ERK IN PRODUCTION"
            uint8_t tmp_erk[] = CFG_BLE_ERK;
            SID_STM32_UTIL_fast_memcpy(buffer->bytes, tmp_erk, sizeof(buffer));
#else
            err = _generate_random_key(buffer->words, SID_STM32_UTIL_ARRAY_SIZE(buffer->words));
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_ADAPTER_UTILS_LOG_ERROR("Failed to generate new BLE ERK. Error %d", (int32_t)err);
                break;
            }
#endif /* SID_STM32_BLE_USE_HARDCODED_SECURITY_KEYS */

            err = sid_pal_storage_kv_record_set(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP, STORAGE_KV_SID_BLE_ADAPTER_ERK_KEY, &buffer->words[0], sizeof(buffer->words));
            if (err != SID_ERROR_NONE)
            {
                SID_BLE_ADAPTER_UTILS_LOG_ERROR("  Fail   : Unable to store BLE ERK to KV storage, error code: %d", err);
                break;
            }
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Stored new BLE ERK");
        }
        else
        {
            /* Failed to read from KV storage */
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_set_gap_ppcp_char(const sid_ble_cfg_conn_param_t * const conn_param)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;

    do
    {
        uint8_t ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_VALUE_LENGTH];

        if (NULL == conn_param)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_INTERVAL_MIN_OFFSET]     = (uint8_t)( conn_param->min_conn_interval       & 0xFFu);
        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_INTERVAL_MIN_OFFSET + 1] = (uint8_t)((conn_param->min_conn_interval >> 8) & 0xFFu);

