stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_INTERVAL_MAX_OFFSET]     = (uint8_t)( conn_param->max_conn_interval       & 0xFFu);
        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_INTERVAL_MAX_OFFSET + 1] = (uint8_t)((conn_param->max_conn_interval >> 8) & 0xFFu);

        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_LATENCY_OFFSET]          = (uint8_t)( conn_param->slave_latency           & 0xFFu);
        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_LATENCY_OFFSET + 1]      = (uint8_t)((conn_param->slave_latency     >> 8) & 0xFFu);

        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_TIMEOUT_OFFSET]          = (uint8_t)( conn_param->conn_sup_timeout        & 0xFFu);
        ppcp_value_buffer[SID_STM32_BLE_PPCP_CHAR_CONN_TIMEOUT_OFFSET + 1]      = (uint8_t)((conn_param->conn_sup_timeout  >> 8) & 0xFFu);

        ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                sid_ble_drv_ctx.gap_ppcp_char_handle,
                                                0u,
                                                sizeof(ppcp_value_buffer),
                                                (uint8_t *)ppcp_value_buffer);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_ADAPTER_UTILS_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Peripheral Preferred Connection Parameters, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_ADAPTER_UTILS_LOG_DEBUG("  Success: aci_gatt_update_char_value - Peripheral Preferred Connection Parameters");

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_stm32wba_ble_adapter_util_calc_min_conn_timeout(const uint32_t conn_interval, const uint32_t conn_latency)
{
    uint32_t conn_timeout = SID_STM32_BLE_MS_TO_CONN_SUPERVISION_UNITS(SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS((conn_latency + 1u) * conn_interval * 2u));
    return conn_timeout;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_stm32wba_ble_adapter_util_calc_max_conn_latency(const uint32_t conn_interval, const uint32_t conn_timeout)
{
    uint32_t conn_latency = (uint32_t)((float)(SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(conn_timeout)) / (2.f * SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(conn_interval))) - 1u; /* Intentional underflow, UINT32_MAX indicates there's no conn_latency to meet the timing requirements */
    return conn_latency;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_stm32wba_ble_adapter_util_calc_max_conn_interval(const uint32_t conn_timeout, const uint32_t conn_latency)
{
    uint32_t conn_interval = SID_STM32_BLE_MS_TO_CONN_INTERVAL_UNITS(SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(conn_timeout) / (2u * (conn_latency + 1u)));

    /* Ensure conn_interval does not lead to conn_timeout violation due to rounding */
    if (sid_stm32wba_ble_adapter_util_calc_min_conn_timeout(conn_interval, conn_latency) > conn_timeout)
    {
        conn_interval--;
    }

    return conn_interval;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_util_validate_proposed_conn_params(const sid_ble_ext_proposed_conn_params_t * const proposed_params, const sid_ble_ext_conn_params_limits_t * const limits,
                                                                                                  sid_ble_ext_accepted_conn_params_t * const out_accepted_params, tBleStatus * const out_le_resp_code)
{
    SID_PAL_ASSERT(proposed_params != NULL);
    SID_PAL_ASSERT(limits != NULL);
    SID_PAL_ASSERT(out_accepted_params != NULL);
    SID_PAL_ASSERT(out_le_resp_code != NULL);

    do
    {
        uint32_t min_required_conn_timeout;

        /* Check minimum connection interval */
        if (proposed_params->interval_min < limits->interval_min)
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Unacceptable BLE connection interval - too low");
            if (proposed_params->interval_max >= limits->interval_min)
            {
                /* There's a room to increase the minimum connection interval value to meet the lower boundary limit */
                out_accepted_params->interval_min = limits->interval_min;
            }
            else
            {
                /* Cannot increase minimum connection interval, reject proposed params */
                *out_le_resp_code = SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS;
                break;
            }
        }
        else
        {
            /* Accept the proposed value */
            out_accepted_params->interval_min = proposed_params->interval_min;
        }

        /* Check maximum connection interval */
        if (proposed_params->interval_max > limits->interval_max)
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Unacceptable BLE connection interval - too high");
            if (proposed_params->interval_min <= limits->interval_max)
            {
                /* There's a room to decrease the maximum connection interval value to meet the lower boundary limit */
                out_accepted_params->interval_max = limits->interval_max;
            }
            else
            {
                /* Cannot decrease maximum connection interval, reject proposed params */
                *out_le_resp_code = SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS;
                break;
            }
        }
        else
        {
            /* Accept the proposed value */
            out_accepted_params->interval_max = proposed_params->interval_max;
        }

        /* Ensure the requested connection timeout is within the valid range */
        if ((proposed_params->timeout < SID_BLE_HCI_SUPERVISION_TIMEOUT_LOWER_LIMIT) || (proposed_params->timeout > SID_BLE_HCI_SUPERVISION_TIMEOUT_UPPER_LIMIT))
        {
            SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Unacceptable BLE connection parameters - proposed timeout is out of BLE spec range");
            *out_le_resp_code = SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS;
            break;
        }

        /* Accept latency as is for now */
        out_accepted_params->latency_max = MIN(proposed_params->latency_max, limits->latency_max);

