stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_utils.c
        /* Calculate the bare minimum connection supervision timeout for the selected connection interval and latency */
        min_required_conn_timeout = sid_stm32wba_ble_adapter_util_calc_min_conn_timeout(out_accepted_params->interval_max, out_accepted_params->latency_max);

        /* Ensure we are within BLE specification */
        if (min_required_conn_timeout < SID_BLE_HCI_SUPERVISION_TIMEOUT_LOWER_LIMIT)
        {
            min_required_conn_timeout = SID_BLE_HCI_SUPERVISION_TIMEOUT_LOWER_LIMIT;
        }
        else if (min_required_conn_timeout > proposed_params->timeout)
        {
            /* The minimum required connection interval exceeds the upper boundary with the given connection interval and latency */
            uint32_t exceeds_limit = TRUE;

            /* Try to reduce connection timeout requirements by reducing latency first */
            uint32_t max_allowed_conn_latency = sid_stm32wba_ble_adapter_util_calc_max_conn_latency(out_accepted_params->interval_max, proposed_params->timeout);
            if (max_allowed_conn_latency != UINT32_MAX)
            {
                /* Timing constraints can be met by reducing connection latency only */
                out_accepted_params->latency_max = max_allowed_conn_latency;
                exceeds_limit = FALSE;
            }
            else
            {
                /* Timing constraints cannot be met for the given interval and supervision timeout by decreasing latency only. Set the latency to zero (bare minimum) and continue the optimization with tweaking connection interval */
                out_accepted_params->latency_max = 0u;
            }

            /* If we cannot optimize with latency and minimum timeout requirements are still too high try optimizing with connection interval */
            if (exceeds_limit != FALSE)
            {
                uint32_t max_allowed_conn_interval = sid_stm32wba_ble_adapter_util_calc_max_conn_interval(proposed_params->timeout, out_accepted_params->latency_max);

                if ((max_allowed_conn_interval >= out_accepted_params->interval_min) && (max_allowed_conn_interval <= out_accepted_params->interval_max))
                {
                    out_accepted_params->interval_max = max_allowed_conn_interval;
                    exceeds_limit = FALSE;
                }
            }

            if (exceeds_limit != FALSE)
            {
                /* Still unacceptable, the remote peer should reduce the minimum connection interval or extend connection timeout */
                SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Unacceptable BLE connection parameters - minimum required conn timeout for given interval and latency exceeds the limit");
                *out_le_resp_code = SID_BLE_HCI_STATUS_UNACCEPTABLE_CONN_PARAMS;
                break;
            }
        }
        else
        {
            /* Within the limits, keep the value */
        }

        if (proposed_params->timeout > limits->reasonable_timeout) /* proposed_params->timeout is guaranteed to be >= min_required_conn_timeout at this point */
        {
            if (min_required_conn_timeout > limits->reasonable_timeout)
            {
                /* Nothing we can do about that, long timeout is required here */
                out_accepted_params->timeout = min_required_conn_timeout;
            }
            else
            {
                /* The new connection timeout is unnecessarily long, cut it down */
                SID_BLE_ADAPTER_UTILS_LOG_DEBUG("Unacceptable Sidewalk BLE connection supervision timeout - unreasonably long");
                out_accepted_params->timeout = limits->reasonable_timeout;
            }
        }
        else
        {
            out_accepted_params->timeout = proposed_params->timeout;
        }

        /* Set connection duration expectations */
        out_accepted_params->ce_length_min = limits->ce_length_min;
        out_accepted_params->ce_length_max = limits->ce_length_max;

        /* New connection parameters are acceptable if we got to this point, we can keep them */
        *out_le_resp_code = BLE_STATUS_SUCCESS;
    } while (0);

    return SID_ERROR_NONE;
}
